using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Linq;
using System.Web;

namespace Max.Web.AppApi.Common
{
    public class ApiEnum
    {
        public enum ResponseCode
        {
            处理成功 = 100,
            处理失败 = 999,
            解析报文错误 = 200,
            无效调用凭证 = 201,
            无效交易类型 = 202,
            参数不正确 = 203,
            系统内部错误 = 210,
            用户无支付密码 = 211,
            支付密码错误 = 212,
            支付失败 = 213,
            EPlus接口错误 = 214,
            账号已冻结 = 229,
            密码错误 = 230,
            用户没有实名认证 = 231,
            用户不是白名单 = 232,
            检查通过 = 0,
            白名单项目非白名单用户 = 1,
            新手项目非新手用户 = 2,
            高收益项目无高收益券 = 3,
            高收益项目有高收益券没选择 = 4,
            可投份额不足 = 5,
            项目不存在 = 6,
            用户没有申请预约 = 7,
            用户不存在 = 300
        }

        public enum ShowMode
        {
            浮层 = 1,
            广告弹窗 = 4
        }

        public enum BizCode
        {
            

            #region 车险

            [Description("kalapay")]
            卡拉支付 = 10001,

            [Description("okpay")]
            ok支付 = 20001,

            #endregion

        }

        public enum AppCheckState
        {
            弹出信息 = 0,
            弹出广告 = 1,
            信用不足 = 2,
            实名认证 = 3,
            信用额度不足 = 4,
            投资信用额度不足 = 5,
            肖像认证 = 6
        }


        /// <summary>
        /// 购物车结算检查+订单提交检查
        /// </summary>
        public enum MallOrderCheckResult
        {
            成功 = 1,
            用户未登录 = 2,
            用户信用额度不足 = 3,
            非新手用户不能购买新手商品 = 4,
            没有特权券不能购买特权商品 = 5,
            库存不足 = 6,
            超过最大限购数量 = 7,
            购物车没有商品 = 8,
            商品已经下架 = 9,
            商户合作终止 = 10,
            参数错误 = 11,
            商品不存在 = 12,
            收货地址不存在 = 13,
            没有实名认证 = 14,
            卡券库存不足 = 15,
            优惠券不存在 = 16,
            优惠券已使用或者已过期 = 17,
            优惠券已禁用 = 18,
            没有找到优惠券对应的商品 = 19,
            商品ID错误 = 20,
            异常错误 = 21,
            请输入手机号码 = 22,
            请输入正确手机号码 = 23,
            请输入加油卡号 = 24,
            直充类型错误 = 25,
            充值项目不存在 = 26,
            充值方式不存在 = 27,
            不存在任何充值项 = 28,
            不存在该充值面值 = 29,
            所选充值面值的商品已下架 = 30,
            所选充值面值的商品已售罄 = 31,
            单笔充值总金额超出限制 = 32,
            该商品不支持使用优惠券 = 33,
            所选优惠券仓库不存在 = 34,
            该商品不能使用该优惠券 = 35,
            所选优惠券仓库已禁用 = 36,
            所选优惠券不属于当前下单用户 = 37,
            本地下单失败 = 38,
            暂不支持指定号码充值 = 39,
            发票信息填写错误 = 40,
        }

        public enum Request31002Type
        {
            我的红包 = 1,
            优惠券 = 2,
            是否开通摇钱宝 = 3,
            我的信用 = 4,
            未读消息数量 = 5,
            肖像认证 = 6,
            实名认证 = 7,
            安全中心等级 = 8,
            微信信息 = 9,
            用户唯一ID = 10,
            是否是摇钱宝新用户 = 11,
            数字密码 = 12,
            指纹支付 = 13,
            推荐人信息 = 14,
            是否设置了工资定投 = 15,
            是否显示工资定投过度页 = 16
        }

        public enum Request31013Type
        {
            是否设置了工资定投 = 15,
            是否显示工资定投过度页 = 16
        }

        public enum LoginErrorType
        {
            正常 = 0,
            密码错误 = 1,
            账户冻结 = 2,
            参数错误 = 3,
            未设置登录密码 = 4,
        }

        public enum DealResult
        {
            失败 = 0,
            成功 = 1
        }

        /// <summary>
        /// 特殊场景状态码
        /// </summary>        
        public enum SpecialSceneStatusCode
        {
            EPlus实名认证 = 1,
            支付密码错误 = 10,
            余额不足 = 11
        }
    }
}